backend/app/Controllers/Resep.php

SELECT *
FROM `resep`
---
    public function index()
    {
        $model = new ResepModel();
        $data = $model->findAll();

SELECT *
FROM `resep`
WHERE `resep`.`id_resep` IN ('17')
---
    public function show($id = null)
    {
        $model = new ResepModel();
        $data = $model->find(['id_resep' => $id]);

INSERT INTO `resep` (`judul_resep`, `penjelasan`, `bahan`, `langkah`) VALUES ('Batagor Bandung', 'Sore hari paling enak ngemil batagor. Bakso tahu goreng ini teksturnya yang renyah di luar dan kenyal di dalam, bikin batagor disukai banyak orang. Makanan khas asli bandung ini disajikan bersama saus kacang dan kecap manis. Kalau mau menikmati batagor lezat, anda tidak harus selalu membelinya karena membuat batagor tidaklah sulit.', 'iya budi', 'budi')
---
    public function create()
    {
        $json = $this->request->getJSON();
        $data = [
            'judul_resep' => $json->judul_resep,
            'penjelasan' => $json->penjelasan,
            'bahan' => $json->bahan,
            'langkah' => $json->langkah
        ];
        $model = new ResepModel();
        $resep = $model->insert($data);